fitranurmayadi/esp32-microlm/kibo_esp32/kibo_inference.cpp
#include "kibo_inference.h"

KiboModel kibo_model;

static float* act_x = NULL;
static float* act_xb = NULL;
static float* act_qkv = NULL;
static float* act_att = NULL;
static float* act_mlp = NULL;
static float* act_proj = NULL;
static float* act_mlp_proj = NULL;
static float* act_logits = NULL;

static float* kv_k_cache = NULL;
static float* kv_v_cache = NULL;

static const uint8_t* mmap_base = NULL;
#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
static esp_partition_mmap_handle_t mmap_handle;
#define KIBO_MMAP_DATA ESP_PARTITION_MMAP_DATA
#else
#include "esp_spi_flash.h"
static spi_flash_mmap_handle_t mmap_handle;
#define KIBO_MMAP_DATA SPI_FLASH_MMAP_DATA
#endif

static void safe_flash_copy(void* dest, const void* src, size_t n) {
    uint8_t* d = (uint8_t*)dest;
    const uint8_t* s = (const uint8_t*)src;
    for (size_t i = 0; i < n; i++) {
        d[i] = s[i];
    }
}

static inline uint32_t read_u32(const uint8_t* p) {
    uint32_t v = 0;
    safe_flash_copy(&v, p, sizeof(v));
    return v;
}

static inline int32_t read_i32(const uint8_t* p) {
    int32_t v = 0;
    safe_flash_copy(&v, p, sizeof(v));
    return v;
}

static inline float read_f32(const uint8_t* p) {
    float v = 0.0f;
    safe_flash_copy(&v, p, sizeof(v));
    return v;
}

static void layer_norm(float* out, const float* x, const float* w, const float* b, int dim) {
    float mean = 0.0f;
    for (int i = 0; i < dim; i++) mean += x[i];
    mean /= dim;
    
    float var = 0.0f;
    for (int i = 0; i < dim; i++) {
        float diff = x[i] - mean;
        var += diff * diff;
    }
    var /= dim;
    float inv_std = 1.0f / sqrtf(var + 1e-5f);
    
    for (int i = 0; i < dim; i++) {
        out[i] = (x[i] - mean) * inv_std * w[i] + b[i];
    }
}

static void matmul_int8_vec(float* out, const float* x, const int8_t* w, float scale, const float* bias, int rows, int cols) {
    for (int r = 0; r < rows; r++) {
        float dot = 0.0f;
        const int8_t* w_row = w + r * cols;
        for (int c = 0; c < cols; c++) {
            dot += x[c] * (float)w_row[c];
        }
        float sum = dot * scale;
        if (bias != NULL) {
            sum += bias[r];
        }
        out[r] = sum;
    }
}

static float gelu_act(float x) {
    return 0.5f * x * (1.0f + tanhf(0.79788456f * (x + 0.044715f * x * x * x)));
}

static int effective_max_seq_len = MAX_SEQ_LEN;

static void forward_token(int token, int pos, int seq_len) {
    for (int i = 0; i < N_EMBD; i++) {
        float tok_val = ((float)kibo_model.tok_emb_w[token * N_EMBD + i]) * kibo_model.tok_emb_scale;
        float pos_val = ((float)kibo_model.pos_emb_w[pos * N_EMBD + i]) * kibo_model.pos_emb_scale;
        act_x[i] = tok_val + pos_val;
    }
    
    for (int l = 0; l < N_LAYER; l++) {
        TransformerBlock& blk = kibo_model.blocks[l];
        
        layer_norm(act_xb, act_x, blk.ln1_w, blk.ln1_b, N_EMBD);
        matmul_int8_vec(act_qkv, act_xb, blk.qkv_w, blk.qkv_scale, blk.qkv_b, 3 * N_EMBD, N_EMBD);
        
        float* q = act_qkv;
        float* k = act_qkv + N_EMBD;
        float* v = act_qkv + 2 * N_EMBD;
        
        int kv_offset = (l * effective_max_seq_len + pos) * N_EMBD;
        for (int i = 0; i < N_EMBD; i++) {
            kv_k_cache[kv_offset + i] = k[i];
            kv_v_cache[kv_offset + i] = v[i];
        }
        
        float* att_out = act_xb;
        for (int i = 0; i < N_EMBD; i++) att_out[i] = 0.0f;
        
        float scale = 1.0f / sqrtf((float)HEAD_DIM);
        
        for (int h = 0; h < N_HEAD; h++) {
            const float* q_h = q + h * HEAD_DIM;
            float* att_scores = act_att + h * effective_max_seq_len;
            
            float max_score = -1e9f;
            for (int t = 0; t <= pos; t++) {
                int prev_kv_offset = (l * effective_max_seq_len + t) * N_EMBD + h * HEAD_DIM;
                const float* k_h = kv_k_cache + prev_kv_offset;
                
                float dot = 0.0f;
                for (int d = 0; d < HEAD_DIM; d++) {
                    dot += q_h[d] * k_h[d];
                }
                dot *= scale;
                att_scores[t] = dot;
                if (dot > max_score) max_score = dot;
            }
            
            float sum_exp = 0.0f;
            for (int t = 0; t <= pos; t++) {
                att_scores[t] = expf(att_scores[t] - max_score);
                sum_exp += att_scores[t];
            }
            float inv_sum = 1.0f / sum_exp;
            for (int t = 0; t <= pos; t++) {
                att_scores[t] *= inv_sum;
            }
            
            float* head_out = att_out + h * HEAD_DIM;
            for (int t = 0; t <= pos; t++) {
                int prev_v_offset = (l * effective_max_seq_len + t) * N_EMBD + h * HEAD_DIM;
                const float* v_h = kv_v_cache + prev_v_offset;
                float a_t = att_scores[t];
                for (int d = 0; d < HEAD_DIM; d++) {
                    head_out[d] += a_t * v_h[d];
                }
            }
        }
        
        matmul_int8_vec(act_proj, att_out, blk.proj_w, blk.proj_scale, blk.proj_b, N_EMBD, N_EMBD);
        for (int i = 0; i < N_EMBD; i++) {
            act_x[i] += act_proj[i];
        }
        
        layer_norm(act_xb, act_x, blk.ln2_w, blk.ln2_b, N_EMBD);
        matmul_int8_vec(act_mlp, act_xb, blk.fc_w, blk.fc_scale, blk.fc_b, 4 * N_EMBD, N_EMBD);
        for (int i = 0; i < 4 * N_EMBD; i++) {
            act_mlp[i] = gelu_act(act_mlp[i]);
        }
        
        matmul_int8_vec(act_mlp_proj, act_mlp, blk.mlp_proj_w, blk.mlp_proj_scale, blk.mlp_proj_b, N_EMBD, 4 * N_EMBD);
        for (int i = 0; i < N_EMBD; i++) {
            act_x[i] += act_mlp_proj[i];
        }
        
        yield();
    }
    
    layer_norm(act_xb, act_x, kibo_model.ln_f_w, kibo_model.ln_f_b, N_EMBD);
    matmul_int8_vec(act_logits, act_xb, kibo_model.head_w, kibo_model.head_scale, NULL, VOCAB_SIZE, N_EMBD);
    yield();
}

static int tokenize_text(const char* text, int* token_ids, int max_len) {
    int count = 0;
    int len = strlen(text);
    int i = 0;
    
    while (i < len && count < max_len) {
        bool matched = false;
        
        for (int s = 0; s < KIBO_NUM_SPECIAL_TOKENS; s++) {
            const char* st = KIBO_SPECIAL_TOKENS[s];
            int st_len = strlen(st);
            if (strncmp(&text[i], st, st_len) == 0) {
                for (int v = 0; v < VOCAB_SIZE; v++) {
                    if (strcmp(KIBO_VOCAB_TABLE[v], st) == 0) {
                        token_ids[count++] = v;
                        i += st_len;
                        matched = true;
                        break;
                    }
                }
                if (matched) break;
            }
        }
        if (matched) continue;
        
        char single_char[2] = { text[i], '\0' };
        int token_found = -1;
        for (int v = 0; v < VOCAB_SIZE; v++) {
            if (strcmp(KIBO_VOCAB_TABLE[v], single_char) == 0) {
                token_found = v;
                break;
            }
        }
        
        if (token_found != -1) {
            token_ids[count++] = token_found;
        } else {
            token_ids[count++] = 1; // <UNK>
        }
        i++;
    }
    return count;
}

