fitranurmayadi/esp32-microlm/kibo_esp32/kibo_inference.cpp
static bool kibo_math_calculator(const String& input, String& response) {
    String clean = input;
    clean.toLowerCase();
    clean.replace("?", "");
    clean.replace("!", "");
    clean.replace(",", "");
    
    // Normalize English math words to standard operators
    clean.replace(" multiplied by ", " * ");
    clean.replace(" times ", " * ");
    clean.replace(" divided by ", " / ");
    clean.replace(" over ", " / ");
    clean.replace(" plus ", " + ");
    clean.replace(" added to ", " + ");
    clean.replace(" minus ", " - ");
    clean.replace(" subtracted by ", " - ");
    clean.replace(" x ", " * ");
    clean.replace(" : ", " / ");
    clean.trim();

    double a = 0, b = 0;
    char op = 0;
    bool found = false;
    
    int n = sscanf(clean.c_str(), "what is %lf %c %lf", &a, &op, &b);
    if (n == 3) found = true;
    if (!found) {
        n = sscanf(clean.c_str(), "calculate %lf %c %lf", &a, &op, &b);
        if (n == 3) found = true;
    }
    if (!found) {
        n = sscanf(clean.c_str(), "how much is %lf %c %lf", &a, &op, &b);
        if (n == 3) found = true;
    }
    if (!found) {
        n = sscanf(clean.c_str(), "%lf %c %lf", &a, &op, &b);
        if (n == 3 && (op == '+' || op == '-' || op == '*' || op == '/')) {
            found = true;
        }
    }
    
    // Also support regex-like search for any "<number> <op> <number>" anywhere in sentence
    if (!found) {
        int op_idx = -1;
        char found_op = 0;
        for (int i = 0; i < (int)clean.length(); i++) {
            char c = clean[i];
            if (c == '+' || c == '-' || c == '*' || c == '/') {
                if (i > 0 && (clean[i-1] == ' ' || isDigit(clean[i-1]))) {
                    op_idx = i;
                    found_op = c;
                    break;
                }
            }
        }
        if (op_idx > 0) {
            String left = clean.substring(0, op_idx);
            String right = clean.substring(op_idx + 1);
            left.trim();
            right.trim();
            int last_space = left.lastIndexOf(' ');
            if (last_space != -1) left = left.substring(last_space + 1);
            int next_space = right.indexOf(' ');
            if (next_space != -1) right = right.substring(0, next_space);
            
            if (left.length() > 0 && right.length() > 0) {
                a = left.toDouble();
                b = right.toDouble();
                op = found_op;
                found = true;
            }
        }
    }
    
    if (found) {
        double res = 0;
        if (op == '+') res = a + b;
        else if (op == '-') res = a - b;
        else if (op == '*') res = a * b;
        else if (op == '/') {
            if (b == 0) {
                response = "🧮 [Tool CALC Error]\nKibo: [ANGRY] Oops, division by zero is not allowed!";
                return true;
            }
            res = a / b;
        } else {
            return false;
        }
        
        String res_str = (res == (long)res) ? String((long)res) : String(res, 2);
        String a_str = (a == (long)a) ? String((long)a) : String(a, 2);
        String b_str = (b == (long)b) ? String((long)b) : String(b, 2);
        
        response = "🧮 [Tool CALC: " + a_str + " " + String(op) + " " + b_str + " = " + res_str + "]\n";
        response += "Kibo: [CALC: " + a_str + " " + String(op) + " " + b_str + "] [HAPPY] The result of " + a_str + " " + String(op) + " " + b_str + " is " + res_str + "! Kibo is great at math! 🧠✨";
        return true;
    }
    return false;
}

extern "C" const uint8_t kibo_embedded_model_start[];
extern "C" const uint8_t kibo_embedded_model_end[];

bool kibo_init_model() {
    act_x = (float*)malloc(N_EMBD * sizeof(float));
    act_xb = (float*)malloc(N_EMBD * sizeof(float));
    act_qkv = (float*)malloc(3 * N_EMBD * sizeof(float));
    act_att = (float*)malloc(N_HEAD * MAX_SEQ_LEN * sizeof(float));
    act_mlp = (float*)malloc(4 * N_EMBD * sizeof(float));
    act_proj = (float*)malloc(N_EMBD * sizeof(float));
    act_mlp_proj = (float*)malloc(N_EMBD * sizeof(float));
    act_logits = (float*)malloc(VOCAB_SIZE * sizeof(float));
    
    // Dynamic KV Cache: 128 context on PSRAM boards, 42 context on SRAM-only boards (Nano ESP32)
    if (psramFound() && ESP.getFreePsram() >= 1000000) {
        effective_max_seq_len = MAX_SEQ_LEN; // 128
        size_t kv_size = N_LAYER * effective_max_seq_len * N_EMBD * sizeof(float);
        kv_k_cache = (float*)heap_caps_malloc(kv_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        kv_v_cache = (float*)heap_caps_malloc(kv_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    } else {
        effective_max_seq_len = 42; // Max safe context in 512KB SRAM
        size_t kv_size = N_LAYER * effective_max_seq_len * N_EMBD * sizeof(float);
        kv_k_cache = (float*)malloc(kv_size);
        kv_v_cache = (float*)malloc(kv_size);
    }
    
    if (!act_x || !act_qkv || !kv_k_cache || !kv_v_cache) {
        Serial.println("error: failed to allocate working buffers");
        return false;
    }
    
    Serial.printf("[kibo] working buffers allocated (%u bytes free heap)\n", ESP.getFreeHeap());

    const esp_partition_t* part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_FAT, NULL);
    if (!part) {
        part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "ffat");
    }
    
    size_t model_size = (kibo_embedded_model_end > kibo_embedded_model_start) ? (size_t)(kibo_embedded_model_end - kibo_embedded_model_start) : 2 * 1024 * 1024;
    if (part != NULL && part->size < model_size) {
        model_size = part->size;
    }
    if (psramFound() && ESP.getFreePsram() >= model_size) {
        uint8_t* psram_buf = (uint8_t*)heap_caps_malloc(model_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        if (psram_buf != NULL) {
            if (kibo_embedded_model_start != NULL && (kibo_embedded_model_end > kibo_embedded_model_start)) {
                memcpy(psram_buf, kibo_embedded_model_start, model_size);
            } else if (part != NULL) {
                esp_partition_read(part, 0, psram_buf, model_size);
            }
            if (read_u32(psram_buf) == MODEL_MAGIC) {
                mmap_base = psram_buf;
                Serial.printf("[kibo] psram buffer loaded at 0x%08X (%.2f MB)\n", (uint32_t)mmap_base, model_size / (1024.0 * 1024.0));
            }
        }
    }
    
