fitranurmayadi/esp32-microlm/kibo_esp32/kibo_inference.cpp
    if (mmap_base == NULL && part != NULL) {
        size_t map_size = (part->size < 2 * 1024 * 1024) ? part->size : 2 * 1024 * 1024;
        const void* ptr = NULL;
        esp_err_t err = esp_partition_mmap(part, 0, map_size, KIBO_MMAP_DATA, &ptr, &mmap_handle);
        if (err == ESP_OK && ptr != NULL && read_u32((const uint8_t*)ptr) == MODEL_MAGIC) {
            mmap_base = (const uint8_t*)ptr;
            Serial.printf("[kibo] flash mmap mapped at 0x%08X\n", (uint32_t)mmap_base);
        }
    }
    
    if (mmap_base == NULL) {
        mmap_base = kibo_embedded_model_start;
        Serial.printf("[kibo] loaded from embedded flash at 0x%08X\n", (uint32_t)mmap_base);
    }
    
    uint32_t magic = read_u32(mmap_base);
    if (magic != MODEL_MAGIC) {
        Serial.printf("[kibo] error: invalid magic header (0x%08X != 0x%08X)\n", magic, MODEL_MAGIC);
        return false;
    }
    
    uint32_t vocab_size = read_u32(mmap_base + 4);
    uint32_t n_embd = read_u32(mmap_base + 8);
    uint32_t n_layer = read_u32(mmap_base + 16);
    uint32_t num_tensors = read_u32(mmap_base + 24);
    
    Serial.printf("[kibo] tensor layout: vocab=%d embd=%d layers=%d tensors=%d\n", vocab_size, n_embd, n_layer, num_tensors);
    
    uint32_t offset = sizeof(uint32_t) * 7;
    
    for (int t = 0; t < (int)num_tensors; t++) {
        int32_t name_len = read_i32(mmap_base + offset); offset += 4;
        if (name_len <= 0 || name_len >= 64) {
            Serial.printf("[kibo] error: invalid tensor name length: %d\n", name_len);
            return false;
        }
        
        char tensor_name[64] = {0};
        safe_flash_copy(tensor_name, mmap_base + offset, name_len); offset += name_len;
        
        int32_t is_quant = read_i32(mmap_base + offset); offset += 4;
        float scale = read_f32(mmap_base + offset); offset += 4;
        int32_t num_elements = read_i32(mmap_base + offset); offset += 4;
        
        const uint8_t* data_ptr = mmap_base + offset;
        uint32_t data_bytes = (is_quant ? num_elements : num_elements * 4);
        
        String name = String(tensor_name);
        
        if (name == "tok_emb.weight") {
            kibo_model.tok_emb_scale = scale;
            kibo_model.tok_emb_w = (const int8_t*)data_ptr;
        } else if (name == "pos_emb.weight") {
            kibo_model.pos_emb_scale = scale;
            kibo_model.pos_emb_w = (const int8_t*)data_ptr;
        } else if (name == "head.weight") {
            kibo_model.head_scale = scale;
            kibo_model.head_w = (const int8_t*)data_ptr;
        } else if (name == "ln_f.weight") {
            safe_flash_copy(kibo_model.ln_f_w, data_ptr, num_elements * sizeof(float));
        } else if (name == "ln_f.bias") {
            safe_flash_copy(kibo_model.ln_f_b, data_ptr, num_elements * sizeof(float));
        } else if (name.startsWith("blocks.")) {
            int layer = name.substring(7, 8).toInt();
            if (layer >= 0 && layer < N_LAYER) {
                TransformerBlock& blk = kibo_model.blocks[layer];
                if (name.endsWith("ln_1.weight")) safe_flash_copy(blk.ln1_w, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("ln_1.bias")) safe_flash_copy(blk.ln1_b, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("attn.c_attn.weight")) { blk.qkv_scale = scale; blk.qkv_w = (const int8_t*)data_ptr; }
                else if (name.endsWith("attn.c_attn.bias")) safe_flash_copy(blk.qkv_b, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("attn.c_proj.weight")) { blk.proj_scale = scale; blk.proj_w = (const int8_t*)data_ptr; }
                else if (name.endsWith("attn.c_proj.bias")) safe_flash_copy(blk.proj_b, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("ln_2.weight")) safe_flash_copy(blk.ln2_w, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("ln_2.bias")) safe_flash_copy(blk.ln2_b, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("mlp.c_fc.weight")) { blk.fc_scale = scale; blk.fc_w = (const int8_t*)data_ptr; }
                else if (name.endsWith("mlp.c_fc.bias")) safe_flash_copy(blk.fc_b, data_ptr, num_elements * sizeof(float));
                else if (name.endsWith("mlp.c_proj.weight")) { blk.mlp_proj_scale = scale; blk.mlp_proj_w = (const int8_t*)data_ptr; }
                else if (name.endsWith("mlp.c_proj.bias")) safe_flash_copy(blk.mlp_proj_b, data_ptr, num_elements * sizeof(float));
            }
        }
        
        offset += data_bytes;
    }
    
    Serial.println("[kibo] int8 inference engine initialized");
    return true;
}

void run_live_mcu_benchmark() {
    Serial.println("\n==========================================================================");
    Serial.println("  🔬 LIVE ON-CHIP QUANTIZATION BENCHMARK (ESP32-S3 @ 240MHz XTENSA LX7)   ");
    Serial.println("==========================================================================");
    Serial.printf("Layer Dimensions: 192 -> 768 (147,456 weights per linear projection)\n");
    Serial.printf("Testing with live weights in 8MB Octal PSRAM...\n\n");

    const int rows = 768;
    const int cols = 192;
    const int num_w = rows * cols;
    const int8_t* live_weights = kibo_model.blocks[0].fc_w;
    if (!live_weights) {
        Serial.println("❌ Model weights not loaded!");
        return;
    }

    static float test_x[192];
    static float test_out[768];
    for (int i = 0; i < cols; i++) test_x[i] = 0.5f;

    const int iterations = 10;

    volatile float dummy_sink = 0.0f;

    // 1. INT8 Direct Byte Access (147,456 weights)
    int64_t t0 = esp_timer_get_time();
    for (int it = 0; it < iterations; it++) {
        for (int r = 0; r < rows; r++) {
            float dot = 0.0f;
            const int8_t* w_row = live_weights + r * cols;
            for (int c = 0; c < cols; c++) {
                dot += test_x[c] * (float)w_row[c];
            }
            test_out[r] = dot * 0.005f;
            dummy_sink += test_out[r];
        }
    }
    int64_t t1 = esp_timer_get_time();
    uint32_t int8_us = (uint32_t)((t1 - t0) / iterations);

    // 2. INT4 Nibble Unpacking (Bit-shift + Masking + Sign Extension)
    const uint8_t* packed_w = (const uint8_t*)live_weights;
    t0 = esp_timer_get_time();
    for (int it = 0; it < iterations; it++) {
        for (int r = 0; r < rows; r++) {
            float dot = 0.0f;
            const uint8_t* w_row = packed_w + r * (cols / 2);
            for (int c = 0; c < cols / 2; c++) {
                uint8_t p = w_row[c];
                // 4-bit two's complement sign extension
                int8_t w0 = (int8_t)((p & 0x0F) >= 8 ? (p & 0x0F) - 16 : (p & 0x0F));
                int8_t w1 = (int8_t)((p >> 4) >= 8 ? (p >> 4) - 16 : (p >> 4));
                dot += test_x[c * 2] * (float)w0 + test_x[c * 2 + 1] * (float)w1;
            }
            test_out[r] = dot * 0.01f;
            dummy_sink += test_out[r];
        }
    }
    t1 = esp_timer_get_time();
    uint32_t int4_us = (uint32_t)((t1 - t0) / iterations);

    float ratio = (float)int4_us / (float)(int8_us > 0 ? int8_us : 1);

    Serial.println("--------------------------------------------------------------------------");
    Serial.printf("%-10s | %-15s | %-18s | %-16s\n", "Format", "Weight Footprint", "MatMul Latency (us)", "Relative Speed");
    Serial.println("--------------------------------------------------------------------------");
    Serial.printf("%-10s | %-15s | %10u us       | %-16s\n", "INT8", "1.79 MB", int8_us, "1.00x (Baseline)");
    Serial.printf("%-10s | %-15s | %10u us       | %.2fx (%s)\n", "INT4", "0.88 MB", int4_us, ratio, (int4_us > int8_us ? "Slower due to unpack" : "Faster"));
    Serial.println("==========================================================================\n");
    Serial.printf("💡 Hasil Uji Nyata ESP32-S3:\n");
    if (int4_us > int8_us) {
        float pct_slower = ((float)(int4_us - int8_us) * 100.0f) / (float)int8_us;
        Serial.printf("- Eksekusi INT4 lebih lambat +%.1f%% dibanding INT8 karena siklus CPU terbuang untuk bit-masking (& 0x0F), bit-shifting (>> 4), dan sign extension.\n", pct_slower);
    } else {
        Serial.println("- INT8 dan INT4 memiliki karakteristik kecepatan berimbang di memory bus Octal PSRAM.\n");
    }
}

void kibo_process_chat(const String& user_input) {
    String clean_cmd = user_input;
    clean_cmd.trim();
    clean_cmd.toLowerCase();
    if (clean_cmd == "benchmark" || clean_cmd == "test quant" || clean_cmd == "benchmark quantization") {
        run_live_mcu_benchmark();
        Serial.print("\nUser: ");
        return;
    }

