fitranurmayadi/esp32-microlm/kibo_esp32/kibo_inference.cpp
    String math_resp;
    if (kibo_math_calculator(user_input, math_resp)) {
        Serial.println(math_resp);
        Serial.print("\nUser: ");
        return;
    }
    
    String prompt_text = "User: " + user_input + "\nKibo:";
    
    int token_ids[MAX_SEQ_LEN];
    int prompt_len = tokenize_text(prompt_text.c_str(), token_ids, MAX_SEQ_LEN);
    
    Serial.print("Kibo: ");
    
    int current_seq_len = prompt_len;
    
    for (int pos = 0; pos < prompt_len; pos++) {
        forward_token(token_ids[pos], pos, prompt_len);
    }
    
    int64_t gen_start = esp_timer_get_time();
    int tokens_generated = 0;

    for (int gen = 0; gen < 80; gen++) {
        if (current_seq_len >= effective_max_seq_len - 1) break;
        
        int next_token = 0;
        float max_logit = -1e9f;
        for (int v = 0; v < VOCAB_SIZE; v++) {
            if (act_logits[v] > max_logit) {
                max_logit = act_logits[v];
                next_token = v;
            }
        }
        
        if (next_token == KIBO_EOS_ID || next_token == 0) break;
        
        const char* token_str = KIBO_VOCAB_TABLE[next_token];
        Serial.print(token_str);
        tokens_generated++;
        
        if (strcmp(token_str, "\n") == 0 && gen > 0) break;
        
        token_ids[current_seq_len] = next_token;
        forward_token(next_token, current_seq_len, current_seq_len + 1);
        current_seq_len++;
    }
    
    int64_t gen_end = esp_timer_get_time();
    float total_s = (float)(gen_end - gen_start) / 1000000.0f;
    float tps = (total_s > 0.0f && tokens_generated > 0) ? ((float)tokens_generated / total_s) : 0.0f;

    Serial.println("");
    if (tokens_generated > 0) {
        Serial.printf("⚡ [%d tokens generated in %.2f s | Speed: %.1f tok/s]\n", tokens_generated, total_s, tps);
    }
    Serial.print("\nUser: ");
}
